In [96]:
import numpy as np
import pandas as pd
from io import StringIO

In [106]:
def md_df(md_str: str):
    return pd.read_csv(
        StringIO(md_str.replace(' ', '').replace('-','').strip().strip('|')),  # Get rid of whitespaces
        sep='|'
    ).dropna(
        axis=1,
        how='all'
    )

In [121]:
case_1 = """
| id | name  | salary | managerId |
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | null      |
| 4  | Max   | 90000  | null      |
"""
tmp = md_df(case_1)
tmp

     id   name  salary  managerId
NaN   1    Joe   70000        3.0
NaN   2  Henry   80000        4.0
NaN   3    Sam   60000        NaN
NaN   4    Max   90000        NaN

In [120]:
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    tmp = employee.merge(employee, left_on="managerId", right_on="id", how="left").query("salary_x > salary_y")
    tmp = tmp["name_x"].rename("Employee")
    return pd.DataFrame(tmp)

In [122]:
find_employees(tmp)

  Employee
0      Joe